{"backend": "tensorflow", "config": {"name": "model_72", "input_layers": [["input_73", 0, 0]], "layers": [{"name": "input_73", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_73", "sparse": false, "batch_input_shape": [null, 1000]}}, {"name": "DropInput", "inbound_nodes": [[["input_73", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "DropInput", "dtype": "float32", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}}, {"name": "Dense010", "inbound_nodes": [[["DropInput", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.10000000149011612}, "class_name": "L1L2"}, "dtype": "float32", "name": "Dense010", "kernel_constraint": null, "activation": "relu", "units": 16, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}}}, {"name": "Drop010", "inbound_nodes": [[["Dense010", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "Drop010", "dtype": "float32", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}}, {"name": "Dense020", "inbound_nodes": [[["Drop010", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.10000000149011612}, "class_name": "L1L2"}, "dtype": "float32", "name": "Dense020", "kernel_constraint": null, "activation": "relu", "units": 16, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}}}, {"name": "Drop020", "inbound_nodes": [[["Dense020", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "Drop020", "dtype": "float32", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}}, {"name": "Dense030", "inbound_nodes": [[["Drop020", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.10000000149011612}, "class_name": "L1L2"}, "dtype": "float32", "name": "Dense030", "kernel_constraint": null, "activation": "relu", "units": 16, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}}}, {"name": "Drop030", "inbound_nodes": [[["Dense030", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "Drop030", "dtype": "float32", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}}, {"name": "DenseOutput", "inbound_nodes": [[["Drop030", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "name": "DenseOutput", "kernel_constraint": null, "activation": "sigmoid", "units": 1, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}}}], "output_layers": [["DenseOutput", 0, 0]]}, "class_name": "Model", "keras_version": "2.2.4-tf"}